{
    "aboutMeLink": "About me",
    "experiencesLink": "Experiences",
    "projectsLink": "Projects",
    "blogLink": "Blog",
    "contactLink": "Contact",
    "aboutMeHeader": "About Me",
    "date": "From 02/2021 to 09/2023",
    "introduction_title": "Introduction",
    "introduction_description_1": "During my time at Murex, a leading global software provider for the financial industry, I embraced the challenges of working as a DevOps engineer and honed my skills in the creation and optimization of complex systems.",
    "introduction_description_2": "My experience at Murex involved developing a Python microservice architecture application, implementing robust monitoring and alerting systems, and enhancing continuous integration and continuous delivery (CI/CD) processes. In this section, I will share insights into the projects I worked on, the challenges I encountered, the technologies I utilized, and the invaluable lessons I learned throughout my journey.",
    "technologies_tools_title": "Technologies and Tools",
    "technologies_tools_description": "In the course of my work, I leveraged a wide array of technologies and tools to streamline processes and ensure the optimal functioning of the systems I contributed to.",
    "cloud_title": "Cloud",
    "ops_title": "Operation",
    "monitoring_title": "Monitoring",
    "development_title": "Development",
    "environment_title": "Environment",
    "technologies_tools_description_2": "This diverse and comprehensive toolset allowed me to excel in my role as a DevOps engineer, driving success in my projects and contributing to the company's mission to deliver state-of-the-art software solutions.",
    "project_overview_title": "Project Overview",
    "project_overview_description_1": "At Murex, I worked on an innovative project aimed at enhancing the performance and reliability of the company's financial product calculations library. Written in C++, and configured with CMake, the library aims at giving the price of a financial product according to a lot of market input. As such, I am responsible for ensuring its integration and accessibility for the end users.",
    "project_overview_description_2": "To facilitate the querying of the library, this project involved the development of a Python microservice architecture application and the implementation of continuous integration, continuous delivery, and deployment processes, as well as robust monitoring and alerting systems.",
    "responsibilities_title": "Responsabilities",
    "responsibilities_description": "As the DevOps engineer of my team, I was responsible for several critical tasks, including:",
    "responsibilities_dev_title": "Designing and developing the Python microservice architecture application",
    "responsibilities_dev_description": "This applications consists of a set of microservices that communicate with each other through HTTP.",
    "responsibilities_ci_cd_title": "Implementing continuous integration, continuous delivery, and deployment processes",
    "responsibilities_ci_cd_description": "I ensured faster releases and increased stability in the production environment by setting up and fine-tuning continuous integration and delivery Jenkins pipelines.",
    "responsibilities_linux_title": "Assuring the stability of a linux cluster server",
    "responsibilities_linux_description": "I had under my responsibility the health of a dozen of linux servers. One of my roles were to keep them up to date and ready to host applications or any other developer's project.",
    "responsibilities_monitoring_title": "Implementing robust monitoring and alerting systems",
    "responsibilities_monitoring_description": "I had to set up a monitoring system that would allow me to monitor the health of the microservices application and the linux cluster server.",
    "responsibilities_support_title": "Provided technical support and guidance to team members",
    "responsibilities_support_description_1": "I was responsible for providing technical support to the team members, helping them troubleshoot issues and resolve problems.",
    "responsibilities_support_description_2": "I had to ensure all developers have the necessary tools to work efficiently, and that they are following the best practices.",
    "achievements_title": "Key Achievements",
    "achievements_description": "During my time at Murex, I successfully accomplished several critical tasks and milestones:",
    "achievements_dev_title": "Development of a Python microservice architecture application",
    "achievements_dev_description": "I enforced myself to create modular, scalable, and maintainable solutions by following the best development practices. By doing so, I was able to sharpen my software architecture skills.",
    "achievements_automation_title": "Automations of redundant tasks",
    "achievements_automation_description": "I automated the deployment of the application and the management of users using Jenkins pipelines and Ansible Playbooks. This allowed me to deploy/update the application in less of minutes.",
    "achievements_monitoring_title": "Integration of robust monitoring and alerting systems",
    "achievements_monitoring_description": "By deploying Prometheus and Grafana, along with Logstash and Elasticsearch, I ensured application and system reliability. I was able to proactively addressed potential issues, resulting in minimal downtime and a better user experience.",
    "achievements_security_title": "Implementation of a robust security system",
    "achievements_security_description": "I implemented HTTPS and JWT authentication to ensure the security of the microservices.",
    "achievements_database_title": "Update the database technology",
    "achievements_database_description": "I moved the database from a custom HTTP key-value pair system to Redis, which improved the performance of 30% on several test cases.",
    "achievements_deployment_title": "Update the deployment technology",
    "achievements_deployment_description": "I moved the deployment from custom bash scripts to docker, which improved the maintainability, scalability, and reliability of the deployment.",
    "achievements_tools_title": "Providing development tools",
    "achievements_tools_description": "I provided the team with a set of development tools, including VSCode extensions, Jenkins delivery pipelines, or Ansible Playbooks that improved the productivity of the team.",
    "challenges_title": "Challenges",
    "challenges_description_1": "During my time at Murex, one of the main challenges I faced was the team's initial lack of familiarity with DevOps practices. This barrier made the efficient implementation of new processes and methodologies difficult. In addition, I was practically on my own when it came to managing DevOps tasks, which required a high level of self-reliance, time management, and prioritization skills.",
    "challenges_description_2": "Besides, dealing with the presence of legacy code and past architectural decisions posed a challenge. To overcome this, I focused on sharpening my architecture skills, understanding the intricacies of the financial domain, and addressing the complexities of the software systems."
}