{
    "aboutMeLink": "À propos de moi",
    "experiencesLink": "Expériences",
    "projectsLink": "Projets",
    "aboutMeHeader": "À propos de moi",
    "date": "Depuis 02/2021",
    "introduction_title": "Introduction",
    "introduction_description_1": "Durant mon temps chez Murex, un fournisseur mondial de logiciels leader pour l'industrie financière, j'ai relevé les défis de travailler en tant qu'ingénieur DevOps et affiné mes compétences dans la création et l'optimisation de systèmes complexes.",
    "introduction_description_2": "Mon expérience chez Murex a impliqué le développement d'une application d'architecture de microservices Python, la mise en place de systèmes de surveillance et d'alerte robustes, et l'amélioration des processus d'intégration continue et de livraison continue (CI/CD). Dans cette section, je partagerai des informations sur les projets sur lesquels j'ai travaillé, les défis que j'ai rencontrés, les technologies que j'ai utilisées, et les leçons inestimables que j'ai apprises tout au long de mon parcours.",
    "technologies_tools_title": "Technologies et Outils",
    "technologies_tools_description": "Au cours de mon travail, j'ai utilisé un large éventail de technologies et d'outils pour rationaliser les processus et assurer le fonctionnement optimal des systèmes auxquels j'ai contribué.",
    "cloud_title": "Cloud",
    "monitoring_title": "Surveillance",
    "development_title": "Développement",
    "environment_title": "Environnement",
    "technologies_tools_description_2": "Cet ensemble d'outils diversifié et complet m'a permis d'exceller dans mon rôle d'ingénieur DevOps, de réussir dans mes projets et de contribuer à la mission de l'entreprise de fournir des solutions logicielles de pointe.",
    "project_overview_title": "Aperçu du Projet",
    "project_overview_description_1": "Chez Murex, j'ai travaillé sur un projet innovant visant à améliorer la performance et la fiabilité de la bibliothèque de calculs de produits financiers de l'entreprise. Écrite en C++, et configurée avec CMake, la bibliothèque vise à donner le prix d'un produit financier selon de nombreuses données de marché. À ce titre, je suis responsable de son intégration et de son accessibilité pour les utilisateurs finaux.",
    "project_overview_description_2": "Pour faciliter l'interrogation de la bibliothèque, ce projet a impliqué le développement d'une application d'architecture de microservices Python et la mise en œuvre de processus d'intégration continue, de livraison continue et de déploiement, ainsi que de systèmes de surveillance et d'alerte robustes.",
    "responsibilities_title": "Responsabilités",
    "responsibilities_description": "En tant qu'ingénieur DevOps de mon équipe, j'étais responsable de plusieurs tâches critiques, y compris :",
    "responsibilities_dev_title": "Conception et développement de l'application d'architecture de microservices Python",
    "responsibilities_dev_description": "Cette application se compose d'un ensemble de microservices qui communiquent entre eux via HTTP.",
    "responsibilities_ci_cd_title": "Mise en œuvre de processus d'intégration continue, de livraison continue et de déploiement",
    "responsibilities_ci_cd_description": "J'ai assuré des versions plus rapides et une plus grande stabilité dans l'environnement de production en mettant en place et en affinant les pipelines Jenkins d'intégration continue et de livraison.",
    "responsibilities_linux_title": "Assurer la stabilité d'un serveur de cluster Linux",
    "responsibilities_linux_description": "J'avais sous ma responsabilité la santé d'une douzaine de serveurs Linux. L'un de mes rôles était de les maintenir à jour et prêts à héberger des applications ou tout autre projet de développeur.",
    "responsibilities_monitoring_title": "Mise en œuvre de systèmes de surveillance et d'alerte robustes",
    "responsibilities_monitoring_description": "J'ai dû mettre en place un système de surveillance qui me permettrait de surveiller la santé de l'application de microservices et du serveur de cluster Linux.",
    "responsibilities_support_title": "Fourniture de soutien technique et de conseils aux membres de l'équipe",
    "responsibilities_support_description_1": "J'étais responsable de fournir un soutien technique aux membres de l'équipe, de les aider à dépanner les problèmes et à résoudre les problèmes.",
    "responsibilities_support_description_2": "Je devais m'assurer que tous les développeurs disposent des outils nécessaires pour travailler efficacement et qu'ils suivent les meilleures pratiques.",
    "achievements_title": "Réalisations Clés",
    "achievements_description": "Durant mon temps chez Murex, j'ai réussi plusieurs tâches et jalons critiques :",
    "achievements_dev_title": "Développement d'une application d'architecture de microservices Python",
    "achievements_dev_description": "Je me suis imposé de créer des solutions modulaires, évolutives et maintenables en suivant les meilleures pratiques de développement. Ce faisant, j'ai pu affiner mes compétences en architecture logicielle.",
    "achievements_automation_title": "Automatisation des tâches redondantes",
    "achievements_automation_description": "J'ai automatisé le déploiement de l'application et la gestion des utilisateurs à l'aide de pipelines Jenkins et de Playbooks Ansible. Cela m'a permis de déployer/mettre à jour l'application en moins de minutes.",
    "achievements_monitoring_title": "Intégration de systèmes de surveillance et d'alerte robustes",
    "achievements_monitoring_description": "En déployant Prometheus et Grafana, avec Logstash et Elasticsearch, j'ai assuré la fiabilité de l'application et du système. J'ai pu traiter proactivement les problèmes potentiels, ce qui a entraîné un temps d'arrêt minimal et une meilleure expérience utilisateur.",
    "achievements_security_title": "Mise en place d'un système de sécurité robuste",
    "achievements_security_description": "J'ai mis en œuvre HTTPS et l'authentification JWT pour assurer la sécurité des microservices.",
    "achievements_database_title": "Mise à jour de la technologie de la base de données",
    "achievements_database_description": "J'ai déplacé la base de données d'un système de paires clé-valeur HTTP personnalisé vers Redis, ce qui a amélioré de 30% les performances sur plusieurs cas de test.",
    "achievements_deployment_title": "Mise à jour de la technologie de déploiement",
    "achievements_deployment_description": "J'ai déplacé le déploiement de scripts bash personnalisés vers Docker, ce qui a amélioré la maintenabilité, l'évolutivité et la fiabilité du déploiement.",
    "achievements_tools_title": "Fourniture d'outils de développement",
    "achievements_tools_description": "J'ai fourni à l'équipe un ensemble d'outils de développement, y compris des extensions VSCode, des pipelines de livraison Jenkins, ou des Playbooks Ansible qui ont amélioré la productivité de l'équipe.",
    "challenges_title": "Défis",
    "challenges_description_1": "Durant mon temps chez Murex, l'un des principaux défis que j'ai rencontré était le manque initial de familiarité de l'équipe avec les pratiques DevOps. Cet obstacle a rendu difficile la mise en œuvre efficace de nouveaux processus et méthodologies. De plus, j'étais pratiquement seul pour gérer les tâches DevOps, ce qui nécessitait un haut niveau d'autonomie, de gestion du temps et de compétences en matière de priorisation.",
    "challenges_description_2": "De plus, le fait de devoir faire face à la présence de code hérité et à des décisions architecturales passées posait un défi. Pour surmonter cela, je me suis concentré sur l'affinement de mes compétences en architecture, la compréhension des subtilités du domaine financier, et la gestion des complexités des systèmes logiciels."
}