{
    "aboutMeLink": "About me",
    "experiencesLink": "Experiences",
    "projectsLink": "Projects",
    "blogLink": "Blog",
    "contactLink": "Contact",
    "carouselCaption1Title": "Freelance DevOps Engineer",
    "carouselCaption2Availability": "Available from october 2023",
    "carouselCaptionAskNotify": "Want to get notified ?",
    "welcomeHeader": "Welcome!",
    "introParagraph1": "As a Freelance DevOps engineer, I excel in software development across various industries, specializing in CI/CD pipelines for rapid software delivery. Skilled in automation, monitoring, and high-performance infrastructure, I have experience with microservices, Docker, and cloud platforms like Azure and AWS.",
    "introParagraph2": "Driven by a passion for leveraging technology to solve problems and deliver value, I'm eager to make a positive impact in the software development industry.",
    "moreMeButton": "More about me",
    "resumeButton": "Download my CV",
    "presentationLink": "Presentation",
    "servicesLink": "Services",
    "skillsLink": "Skills",
    "goToExperiencesLink": "Experiences",
    "goToprojectsLink": "Projects",
    "serviceHeader": "Services",
    "cloudSolutionTitle": "Cloud Solutions and Architecture",
    "cloudSolutionText": "I can design and implement cloud-based architectures, migrate on-premises applications to the cloud, and optimize cost efficiency.",
    "sourceCodeTitle": "Source Code Management",
    "sourceCodeText": "I establish effective workflows for version control, facilitate pull requests and code reviews.",
    "devStrategieTitle": "Development of CI/CD Strategies",
    "devStrategieText": "I design and implement continuous integration pipelines, code health solutions and deployment strategies.",
    "sharingTitle": "Training and Knowledge Sharing",
    "sharingText": "I conduct workshops on DevOps best practices, promote Agile methodologies, and provide guidance on effective development best practices.",
    "mainSkillsHeader": "Main skills",
    "devopsHeader": "DevOPS",
    "developmentHeader": "Development",
    "otherSkillsHeader": "Others",
    "certificationsHeader": "Certifications",
    "az400Cert": "DevOps Engineer Expert",
    "az104Cert": "Microsoft Azure Administrator",
    "az900Cert": "Microsoft Azure Fundamentals",
    "experiencesHeader": "Experiences",
    "freelanceAzureDevopsHeader": "Freelance DevOps",
    "freelanceAzureDevopsDescription": "As of today, I will be working as a freelance Azure DevOps engineer.",
    "readMoreBtn": "Read more",
    "murexDevopsHeader": "DevOPS engineer at Murex",
    "murexDescription": "As a DevOps engineer at Murex, I developed a Python microservice application, ensuring continuous integration, delivery, and robust monitoring/alerting systems.",
    "thalesCplusplusHeader": "C++ Developer at Thales",
    "thalesCplusplusDescription": "As a software engineer, I played a key role in modernizing the French army's fleet of military vehicles. I focused on automating testing and deployment processes, gaining valuable experience in the software development cycle.",
    "thalesPythonHeader": "Python Developer at Thales",
    "thalesPythonYear": "2019 (6 month internship)",
    "thalesPythonDescription": "During my internship on the CONTACT project, I developed a graphical user interface (GUI) to remotely control custom platforms simulating military radios.",
    "polytechnicCHeader": "C Developer at Polytechnic University of Valencia",
    "polytechnicCYear": "2018 (4 month internship)",
    "polytechnicCDescription": "I provided technical support for a graduation thesis project focused on developing a robotic arm. I gained valuable experience in robotics, control systems, and research environments.",
    "projectsHeader": "Projects",
    "portfolioTitle": "My portfolio",
    "portfolioDescription": "I developed this portfolio website with Bootstrap 5 and Azure technology, highlighting my ever-evolving skillset and showcasing my expertise in DevOps and deployment.",
    "aboutmeFooter": "Thank you for visiting my portfolio website. Connect with me over socials."
}
