{
    "aboutMeLink": "À propos de moi",
    "experiencesLink": "Expériences",
    "projectsLink": "Projets",
    "blogLink": "Blog",
    "contactLink": "Contact",
    "carouselCaption1Title": "Ingénieur DevOps indépendant",
    "carouselCaption2Availability": "Disponible à partir de septembre 2023",
    "welcomeHeader": "Bienvenue!",
    "introParagraph1": "En tant qu'ingénieur DevOps freelance, j'excelle à créer des solutions logicielles innovantes pour diverses industries, avec une expertise particulière dans les pipelines CI/CD pour des livraisons de logiciels efficaces et rapides. Ma maîtrise de l'automatisation, de la surveillance et des infrastructures haute performance, combinée à mon expérience approfondie avec les microservices, Docker, et des plateformes cloud comme Azure et AWS, me permet d'apporter des solutions solides et adaptées à tous les défis.",
    "introParagraph2": "Animé par une véritable passion pour la technologie comme moyen de résoudre des problèmes et de créer de la valeur, je suis toujours prêt à faire une différence significative dans l'univers du développement logiciel.",
    "resumeButton": "Télécharger mon CV",
    "mainSkillsHeader": "Compétences principales",
    "devopsHeader": "DevOPS",
    "developmentHeader": "Développement",
    "otherSkillsHeader": "Autres",
    "certificationsHeader": "Certifications",
    "azureCert": "Certifié Azure DevOps",
    "containersSkill": "Conteneurs",
    "monitoringSkill": "Surveillance",
    "pythonSkill": "Python",
    "cppSkill": "C++",
    "cmakeSkill": "Cmake",
    "linuxSkill": "Linux",
    "gitSkill": "Git",
    "az400Cert": "AZ-400: Expert ingénieur DevOps",
    "az104Cert": "AZ-104: Administrateur Microsoft Azure",
    "az900Cert": "AZ-900: Principes de base de Microsoft Azure",
    "experiencesHeader": "Expériences",
    "murexDescription": "En tant qu'ingénieur DevOps chez Murex, j'ai développé une application microservice en Python, assurant une intégration continue, une livraison et des systèmes de surveillance/alerte robustes.",
    "thalesDescription": "En tant qu'ingénieur logiciel chez Thales, j'ai contribué au projet SCORPION, modernisant la flotte de véhicules de l'armée française. J'ai travaillé sur le développement logiciel, les tests d'automatisation et l'intégration transparente, connectant les équipes de développement et d'opérations.",
    "projectsHeader": "Projets",
    "portfolioTitle": "Mon portfolio",
    "portfolioDescription": "J'ai développé ce site portfolio avec Bootstrap 5 et les technologies Azure, mettant en valeur mes compétences en constante évolution et démontrant mon expertise en DevOps et déploiement."
}
