{
    "aboutMeLink": "À propos de moi",
    "experiencesLink": "Expériences",
    "projectsLink": "Projets",
    "blogLink": "Blog",
    "contactLink": "Contact",
    "carouselCaption1Title": "Ingénieur Freelance DevOps",
    "carouselCaption2Availability": "Disponible à partir d'octobre 2023",
    "carouselCaptionAskNotify": "Envie d'être informé ?",
    "welcomeHeader": "Bienvenue !",
    "introParagraph1": "En tant qu'ingénieur Freelance DevOps, j'excelle dans le développement de logiciels dans divers secteurs, en me spécialisant dans les pipelines CI/CD pour une livraison rapide des logiciels. Compétent en automatisation, en surveillance et en infrastructure haute performance, j'ai de l'expérience avec les microservices, Docker et les plateformes cloud telles que Azure et AWS.",
    "introParagraph2": "Animé par la passion d'utiliser la technologie pour résoudre des problèmes et offrir de la valeur, je suis désireux d'avoir un impact positif dans l'industrie du développement logiciel.",
    "moreMeButton": "A propos de moi",
    "resumeButton": "Télécharger mon CV",
    "presentationLink": "Présentation",
    "servicesLink": "Services",
    "skillsLink": "Compétences",
    "goToExperiencesLink": "Expériences",
    "goToprojectsLink": "Projets",
    "serviceHeader": "Services",
    "cloudSolutionTitle": "Solutions et architecture cloud",
    "cloudSolutionText": "Je peux concevoir et mettre en œuvre des architectures cloud, migrer des applications sur site vers le cloud et optimiser l'efficacité des coûts.",
    "sourceCodeTitle": "Gestion de code source",
    "sourceCodeText": "J'établis des flux de travail efficaces pour le contrôle de version, facilite les pull requests et les revues de code.",
    "devStrategieTitle": "Développement de stratégies CI/CD",
    "devStrategieText": "Je conçois et mets en œuvre des pipelines d'intégration continue et des stratégies de déploiement .",
    "sharingTitle": "Formation et partage des connaissances",
    "sharingText": "J'anime des ateliers sur les meilleures pratiques DevOps, je fais la promotion des méthodologies Agiles et je fournis des conseils sur les meilleures pratiques de développement.",
    "mainSkillsHeader": "Compétences Principales",
    "devopsHeader": "DevOPS",
    "developmentHeader": "Développement",
    "otherSkillsHeader": "Autres",
    "certificationsHeader": "Certifications",
    "az400Cert": "Expert en Ingénierie DevOps",
    "az104Cert": "Administrateur Microsoft Azure",
    "az900Cert": "Principes de base Microsoft Azure",
    "experiencesHeader": "Expériences",
    "freelanceAzureDevopsHeader": "DevOps Freelance ",
    "freelanceAzureDevopsDescription": "À partir d'aujourd'hui, je travaille en tant qu'indépendant sur des missions de DevOps.",
    "readMoreBtn": "Lire la suite",
    "murexDevopsHeader": "Ingénieur DevOps chez Murex",
    "murexDescription": "En tant qu'ingénieur DevOps chez Murex, j'ai développé une application de microservices en Python, garantissant l'intégration continue, la livraison et la surveillance/alerte.",
    "readMoreBtn1": "Lire la suite",
    "thalesCplusplusHeader": "Développeur C++ chez Thales",
    "thalesCplusplusDescription": "En tant qu'ingénieur logiciel, j'ai joué un rôle dans la modernisation du parc de véhicules militaires de l'armée française. Je me suis concentré sur l'automatisation des processus de test et de déploiement, acquérant une expérience précieuse dans le cycle de développement logiciel.",
    "readMoreBtn2": "Lire la suite",
    "thalesPythonHeader": "Développeur Python chez Thales",
    "thalesPythonYear": "Stage de 6 mois",
    "thalesPythonDescription": "Pendant mon stage sur le projet CONTACT, j'ai développé une interface utilisateur graphique (GUI) pour contrôler à distance des plates-formes personnalisées simulant des radios militaires.",
    "polytechnicCHeader": "Développeur C chez l'Université Polytechnique de Valence",
    "polytechnicCYear": "Stage de 4 mois",
    "polytechnicCDescription": "J'ai apporté un soutien technique pour un projet de thèse de fin d'études axé sur le développement d'un bras robotique. J'ai acquis une expérience précieuse en robotique, en systèmes de contrôle et dans les environnements de recherche.",
    "projectsHeader": "Projets",
    "portfolioTitle": "Mon portfolio",
    "portfolioDescription": "J'ai développé ce site Web de portfolio avec Bootstrap 5 et la technologie Azure, mettant en valeur mon ensemble de compétences en constante évolution et mettant en évidence mon expertise en DevOps et en déploiement.",
    "readMoreBtn3": "Lire la suite",
    "aboutmeFooter": "Merci d'avoir visité mon portfolio. Connectons-nous sur les reseaux."
}
