{
    "aboutMeLink": "About me",
    "blogLink": "Blog",
    "contactLink": "Contact",
    "carouselCaption1Title": "Freelance DevOps Engineer",
    "welcomeHeader": "Welcome!",
    "introParagraph1": "As a Freelance DevOps engineer, I excel in software development across various industries, specializing in CI/CD pipelines for rapid software delivery. Skilled in automation, monitoring, and high-performance infrastructure, I have experience with microservices, containerization, and cloud platforms like Azure and AWS.",
    "introParagraph2": "Driven by a passion for leveraging technology to solve problems and deliver value, I'm eager to make a positive impact in the software development industry.",
    "moreMeButton": "More about me",
    "resumeButton": "Download my resume",
    "servicesHeader": "Services",
    "servicesDescription": "Offering comprehensive DevOps services, I specialize in guiding businesses from initial infrastructure design through to deployment and ongoing monitoring, ensuring optimal performance at each stage.",
    "serviceCloudTitle": "Cloud Infrastructure Design & Architecture",
    "serviceCloudDesc": "Craft tailored cloud solutions that align with your business needs. Benefit from scalable, resilient, and efficient cloud architectures that ensure optimal performance and cost-effectiveness.",
    "serviceCICDTitle": "CI/CD Strategy Development & Implementation",
    "serviceCICDDesc": "Streamline your software development with continuous integration and continuous deployment. Enhance productivity, reduce time-to-market, and ensure consistent quality with bespoke CI/CD pipelines.",
    "serviceSCMTitle": "Source Code Management & Version Control",
    "serviceSCMDesc": "Protect and manage your codebase. Ensure smooth team collaboration, version tracking, and seamless code merges. Say goodbye to code conflicts and hello to organized, efficient development.",
    "serviceMonitoringTitle": "System Monitoring, Alerting, & Performance Optimization",
    "serviceMonitoringDesc": "Stay ahead of issues with real-time system monitoring. Receive timely alerts and employ proactive measures to ensure peak system performance, minimizing downtimes and enhancing user experience.",
    "serviceAutomationTitle": "Infrastructure Automation & Configuration Management",
    "serviceAutomationDesc": "Eliminate manual errors and repetitive tasks. Implement automation solutions that ensure consistent, error-free deployments, and keep your infrastructure in the desired state with efficient configuration management.",
    "serviceTrainingTitle": "Training and Knowledge Sharing",
    "serviceTrainingDesc": "Empower your team with the latest DevOps best practices. Through hands-on training and knowledge sessions, bridge skill gaps and elevate your team's efficiency and output.",
    "mainSkillsHeader": "Main skills",
    "devopsHeader": "DevOPS",
    "developmentHeader": "Development",
    "otherSkillsHeader": "Others",
    "certificationsHeader": "Certifications",
    "certificationDescription": "My dedication to professional excellence in DevOps is demonstrated through the following industry-recognized certifications, each symbolizing a commitment to continual learning and excellence.",
    "az400Cert": "DevOps Engineer Expert",
    "readMoreBtn_0": "Read more",
    "az104Cert": "Microsoft Azure Administrator",
    "readMoreBtn_1": "Read more",
    "az900Cert": "Microsoft Azure Fundamentals",
    "readMoreBtn_2": "Read more",
    "mainSkillDescription": "With a strong command over the DevOps ecosystem, I bring to the table expertise in a comprehensive suite of tools and technologies that are instrumental in building, deploying, and maintaining scalable and efficient software systems.",
    "newsletterTitle": "Join my Newsletter",
    "newsletterDescription": "Subscribe to my newsletter to receive updates on my availabilities. I also write blog articles about my work and my hobbies.",
    "footerUsefulLinks": "Useful Links",
    "footerLinkAboutMe": "About me",
    "footerLinkProjects": "Projects",
    "footerLinkContact": "Contact",
    "footerLinkBlog": "Blog",
    "footerOnThisPage": "On this page",
    "footerLinkPresentation": "Presentation",
    "footerLinkServices": "Services",
    "footerLinkCertifications": "Certifications",
    "footerLinkMainSkills": "Main skills",
    "footerLinkContact_2": "Contact",
    "footerThanksForVisiting": "Thanks for visiting my website. Follow me on my socials"
}