{
    "aboutMeLink": "À propos de moi",
    "blogLink": "Blog",
    "contactLink": "Contact",
    "carouselCaption1Title": "Ingénieur Freelance DevOps",
    "welcomeHeader": "Bienvenue !",
    "introParagraph1": "En tant qu'ingénieur Freelance DevOps, j'excelle dans le développement de logiciels dans divers secteurs, en me spécialisant dans les pipelines CI/CD pour une livraison rapide des logiciels. Compétent en automatisation, en surveillance et en infrastructure haute performance, j'ai de l'expérience avec les microservices, la containerization et les plateformes cloud telles que Azure et AWS.",
    "introParagraph2": "Animé par la passion d'utiliser la technologie pour résoudre des problèmes et offrir de la valeur, je suis désireux d'avoir un impact positif dans l'industrie du développement logiciel.",
    "moreMeButton": "A propos de moi",
    "resumeButton": "Télécharger mon CV",
    "servicesHeader": "Services",
    "servicesDescription": "Offrant des services DevOps complets, je me spécialise dans l'accompagnement des entreprises dès la conception de l'infrastructure initiale jusqu'au déploiement et à la surveillance continue, en garantissant une performance optimale à chaque étape.",
    "serviceCloudTitle": "Conception et Architecture d'Infrastructure Cloud",
    "serviceCloudDesc": "Concevez des solutions cloud sur mesure qui s'alignent avec les besoins de votre entreprise. Bénéficiez d'architectures cloud évolutives, résilientes et efficaces qui assurent une performance optimale et une rentabilité.",
    "serviceCICDTitle": "Développement et Mise en Œuvre de Stratégies CI/CD",
    "serviceCICDDesc": "Rationalisez votre développement logiciel avec l'intégration et le déploiement continus. Améliorez la productivité, réduisez le temps de mise sur le marché et assurez une qualité constante avec des pipelines CI/CD sur mesure.",
    "serviceSCMTitle": "Gestion de Code Source et Contrôle de Version",
    "serviceSCMDesc": "Protégez et gérez votre base de code. Assurez une collaboration d'équipe fluide, un suivi des versions et des fusions de code sans heurt. Dites adieu aux conflits de code et bonjour à un développement organisé et efficace.",
    "serviceMonitoringTitle": "Surveillance Système, Alertes et Optimisation des Performances",
    "serviceMonitoringDesc": "Anticipez les problèmes avec une surveillance système en temps réel. Recevez des alertes opportunes et prenez des mesures proactives pour assurer des performances systèmes optimales, minimisant les temps d'arrêt et améliorant l'expérience utilisateur.",
    "serviceAutomationTitle": "Automatisation d'Infrastructure et Gestion de Configuration",
    "serviceAutomationDesc": "Éliminez les erreurs manuelles et les tâches répétitives. Implémentez des solutions d'automatisation qui garantissent des déploiements constants sans erreur, et maintenez votre infrastructure dans l'état souhaité avec une gestion de configuration efficace.",
    "serviceTrainingTitle": "Formation et Partage de Connaissances",
    "serviceTrainingDesc": "Habilitez votre équipe avec les meilleures pratiques DevOps actuelles. À travers des formations pratiques et des sessions de partage de connaissances, comblez les lacunes en compétences et améliorez l'efficacité et la production de votre équipe.",
    "mainSkillsHeader": "Compétences Principales",
    "certificationsHeader": "Certifications",
    "certificationDescription": "Mon engagement envers l'excellence professionnelle en DevOps est démontré par les certifications reconnues par l'industrie suivantes, chacune symbolisant un engagement envers l'apprentissage continu et l'excellence.",
    "az400Cert": "Expert en Ingénierie DevOps",
    "readMoreBtn_0": "En savoir plus",
    "az104Cert": "Administrateur Microsoft Azure",
    "readMoreBtn_1": "En savoir plus",
    "az900Cert": "Principes de base Microsoft Azure",
    "mainSkillDescription": "Avec une solide maîtrise de l'écosystème DevOps, j'apporte une expertise dans une gamme complète d'outils et de technologies qui sont essentiels pour construire, déployer et maintenir des systèmes logiciels évolutifs et efficaces.",
    "newsletterTitle": "Rejoignez ma Newsletter",
    "newsletterDescription": "Abonnez-vous à ma newsletter pour recevoir des mises à jour sur mes disponibilités. J'écris également des articles de blog sur mon travail et mes loisirs.",
    "readMoreBtn_2": "En savoir plus",
    "footerUsefulLinks": "Liens utiles",
    "footerLinkAboutMe": "À propos de moi",
    "footerLinkProjects": "Projets",
    "footerLinkContact": "Contact",
    "footerLinkBlog": "Blog",
    "footerOnThisPage": "Sur cette page",
    "footerLinkPresentation": "Présentation",
    "footerLinkServices": "Services",
    "footerLinkCertifications": "Certifications",
    "footerLinkMainSkills": "Compétences principales",
    "footerLinkContact_2": "Contact",
    "footerThanksForVisiting": "Merci d'avoir visité mon site web. Suivez-moi sur mes réseaux sociaux"
}